export const jobType = [
  'иное',
  'рабочий',
  'специалист',
  'руководитель',
] as const

export const coreActivityTypes = [
  'Авиационный транспорт',
  'Водный транспорт',
  'Водоснабжение',
  'Газовая промышленность',
  'Государственное управление',
  'Деревообработка',
  'Деятельность в сфере административных и вспомогательных услуг',
  'Деятельность частных домашних хозяйств',
  'Деятельность экстерриториальных организаций и органов',
  'Железнодорожный',
  'Здравоохранение и социальные услуги',
  'Лесная промышленность',
  'Машины и металлообрабатывающая промышленность',
  'Недвижимость',
  'Образование',
  'Пищевая промышленность',
  'Почтовая и курьерская деятельность',
  'Профессиональная, научная и техническая деятельность',
  'Ремонт автомобилей и мотоциклов',
  'Сбор, обработка и удаление отходов, деятельность по ликвидации загрязнений',
  'Сельское хозяйство',
  'Складирование',
  'Средства массовой информации и телекоммуникаций',
  'Строительство',
  'Творчество, спорт, развлечения и отдых',
  'Торговля и коммерческая деятельность',
  'Транспортная деятельность',
  'Угольная промышленность',
  'Услуги проживания',
  'Финансово-инвестиционные компании',
  'Химическая и нефтехимическая промышленность',
  'Цветная металлургия',
  'Черная металлургия',
  'Энергетическая промышленность',
  'Другие',
] as const

export const organizationManagementTypes = [
  'физическое лицо',
  'индивидуальный предприниматель',
  'юридическое лицо',
] as const

export const accountingManagementTypes = [
  'физическое лицо',
  'юридическое лицо/ИП',
] as const

export const servicingBanks = [
  'ОАО "АСБ Беларусбанк"',
  'ОАО "Белагропромбанк"',
  'ОАО "Белинвестбанк"',
  'ОАО "Банк Дабрабыт"',
  'ОАО "Паритетбанк"',
  'ОАО "Сбер Банк"',
  'ОАО "Белгазпромбанк"',
  'ОАО "Банк БелВЭБ"',
  'ЗАО "МТБанк"',
  'ОАО "Технобанк"',
  'ОАО "БНБ-Банк"',
  'ЗАО "ТК Банк"',
  'ЗАО "БСБ Банк"',
  'ЗАО "Банк РРБ"',
  'ЗАО "Банк "Решение"',
  'ЗАО "БТА Банк"',
  'ОАО "СтатусБанк"',
  'ЗАО "Цептер Банк"',
  'ОАО "Приорбанк"',
  'ЗАО "Альфа-Банк"',
  'ЗАО "Банк ВТБ" (Беларусь)',
] as const

export const typesOfProperty = ['квартира', 'офис', 'склад'] as const

export const maritalStatuses = ['женат/замужем', 'не женат/не замужем'] as const

export const educationTypes = [
  'общее среднее образование',
  'профессионально-техническое образование',
  'среднее специальное образование',
  'высшее образование',
] as const
